#include "utils.h"

void welcome() {
    cout << "\033[1;35m";
    cout << "Лабораторна робота 5. Дослідження процесу створення структур та обʼєднаних даних\n";
    cout << "\033[1;36m";
    cout << "Завдання 2. Security Manager на основі структурм для зберігання даних користувача\n";
    cout << "\033[1;35m";
    cout << "Парафіло Яна. КБ-22. Варіант 1 \n";
    cout << "\033[0m";
}

void menu() {
    cout << "\033[1;36m";
    cout << "\n\t\t\tМЕНЮ\n";
    cout << "\033[1;33m";
    cout << "\t1. Додати користувача\n";
    cout << "\t2. Увійти\n";
    cout << "\t3. Змінити пароль\n";
    cout << "\t4. Зашифрувати дані\n";
    cout << "\t5. Розшифрувати дані\n";
    cout << "\t6. Вивести список користувачів\n";
    cout << "\tІнше Вихід\n";
    cout << "\033[0m";
}

void outp(const User* users, int userCount) {
    cout << "Список користувачів:\n";
    for (int i = 0; i < userCount; ++i) {
        cout << "ID: " << "\033[1;35m" << users[i].id
             << "\033[0m" << ", Логін: " << "\033[1;35m" << users[i].login
             //<< "\033[0m" << ", Хеш паролю : " << "\033[1;35m" << users[i].passHash
             << "\033[0m" << ", Рівень доступу: " << "\033[1;35m" << users[i].accessLvl
             << "\033[0m"<< ", Статус: " << "\033[1;35m" << (users[i].isLocked ? "Заблокований" : "Активний") << "\033[0m" << endl;
    }
}